In [1]:
# Import Library

import pandas as pd
import numpy as np

In [2]:
# Create an example DataFrame

# To have "NaN" values in our dataFrame write np.nan

df=pd.DataFrame({"A":[np.nan,"1.0",np.nan,"4.0",np.nan,"1.0"],
                "B":[np.nan,"4.0","8.0",np.nan,"8.0","1.0"],
                "C":[np.nan,"4.0","2.0","3.0",np.nan,"5.0"]})

In [3]:
#check the created DataFrame

df

     A    B    C
0  NaN  NaN  NaN
1  1.0  4.0  4.0
2  NaN  8.0  2.0
3  4.0  NaN  3.0
4  NaN  8.0  NaN
5  1.0  1.0  5.0

In [4]:
#To Drop NaN's 

df=df.dropna()

In [5]:
# Check if Row's are dropped containg NaN in it.

df

     A    B    C
1  1.0  4.0  4.0
5  1.0  1.0  5.0

In [6]:
# Above we can observe that index is 1,5 
# We need to reset it 

df.reset_index(drop=True)

     A    B    C
0  1.0  4.0  4.0
1  1.0  1.0  5.0

### ----------------------------------------------------Question 3 Ends -------------------------------------------------------